<a href="https://colab.research.google.com/github/skiym-aaa/practice-kaggle/blob/master/02_Pandas%E5%85%A5%E9%96%80.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd

In [2]:
import numpy as np

In [3]:
df = pd.DataFrame( {
    "性別": ["female", "male", "female", "male"],
    "年齢": [53, 21, 31, np.nan],
    "兄弟姉妹": [0, 1, 1, 2],
    "親子": [0, 1, 3, 2],
    "生存": [1, 0, 1, 1]
}, index=["1","2","3","4"])

display(df)

df["家族"] = df["兄弟姉妹"] + df["親子"] + 1

df["性別"] = df["性別"].replace({"female": 0, "male": 1})

df["年齢"] = df["年齢"].fillna(df["年齢"].mean())

df.drop(["兄弟姉妹", "親子"], axis=1, inplace=True)

display(df)

       性別    年齢  兄弟姉妹  親子  生存
1  female  53.0     0   0   1
2    male  21.0     1   1   0
3  female  31.0     1   3   1
4    male   NaN     2   2   1

   性別    年齢  生存  家族
1   0  53.0   1   1
2   1  21.0   0   3
3   0  31.0   1   5
4   1  35.0   1   5

In [4]:
df = pd.read_csv('sample_data/california_housing_train.csv')
df.head()

   longitude  latitude  ...  median_income  median_house_value
0    -114.31     34.19  ...         1.4936             66900.0
1    -114.47     34.40  ...         1.8200             80100.0
2    -114.56     33.69  ...         1.6509             85700.0
3    -114.57     33.64  ...         3.1917             73400.0
4    -114.57     33.57  ...         1.9250             65500.0

[5 rows x 9 columns]

In [5]:
from IPython.display import display

df = pd.DataFrame({
    "性別": ["female", "male", "female", "male"],
    "年齢": [53, 21, 31, np.nan],
    "兄弟姉妹": [0, 1, 1, 2],
    "親子": [0, 1, 3, 2],
    "生存": [1, 0, 1, 1]
}, index=["1", "2", "3", "4"])
display(df)

df["家族"] = df["兄弟姉妹"] + df["親子"] + 1
display(df)

       性別    年齢  兄弟姉妹  親子  生存
1  female  53.0     0   0   1
2    male  21.0     1   1   0
3  female  31.0     1   3   1
4    male   NaN     2   2   1

       性別    年齢  兄弟姉妹  親子  生存  家族
1  female  53.0     0   0   1   1
2    male  21.0     1   1   0   3
3  female  31.0     1   3   1   5
4    male   NaN     2   2   1   5

In [6]:
df["親子"]

1    0
2    1
3    3
4    2
Name: 親子, dtype: int64

In [9]:
df = pd.DataFrame({
    "性別": ["female", "male", "female", "male"],
    "年齢": [53, 21, 31, np.nan],
    "兄弟姉妹": [0, 1, 1, 2],
    "親子": [0, 1, 3, 2],
    "生存": [1, 0, 1, 1]
}, index=["1", "2", "3", "4"])
display(df)

df["性別"] = df["性別"].replace({"female": 0, "male": 1})
display(df)

       性別    年齢  兄弟姉妹  親子  生存
1  female  53.0     0   0   1
2    male  21.0     1   1   0
3  female  31.0     1   3   1
4    male   NaN     2   2   1

   性別    年齢  兄弟姉妹  親子  生存
1   0  53.0     0   0   1
2   1  21.0     1   1   0
3   0  31.0     1   3   1
4   1   NaN     2   2   1

In [10]:
f = open("_test_data.csv", "w")
f.write(",C1,C2,C3\n")
f.write("R1,1,2,3\n")
f.write("R2,2,,1\n")
f.write("R3,3,7,9\n")
f.close()

In [11]:
!cat _test_data.csv

,C1,C2,C3
R1,1,2,3
R2,2,,1
R3,3,7,9

In [13]:
df = pd.read_csv("_test_data.csv", index_col=0)
df

    C1   C2  C3
R1   1  2.0   3
R2   2  NaN   1
R3   3  7.0   9

In [14]:
df = pd.DataFrame({
    "性別": ["female", "male", "female", "male"],
    "年齢": [53, 21, 31, np.nan],
    "兄弟姉妹": [0, 1, 1, 2],
    "親子": [0, 1, 3, 2],
    "生存": [1, 0, 1, 1]
}, index=["1", "2", "3", "4"])
display(df)

ave_age = df["年齢"].mean()
df["年齢"] = df["年齢"].fillna(ave_age)
display(df)

       性別    年齢  兄弟姉妹  親子  生存
1  female  53.0     0   0   1
2    male  21.0     1   1   0
3  female  31.0     1   3   1
4    male   NaN     2   2   1

       性別    年齢  兄弟姉妹  親子  生存
1  female  53.0     0   0   1
2    male  21.0     1   1   0
3  female  31.0     1   3   1
4    male  35.0     2   2   1

In [15]:
df = pd.DataFrame({
    "性別": ["female", "male", "female", "male"],
    "年齢": [53, 21, 31, np.nan],
    "兄弟姉妹": [0, 1, 1, 2],
    "親子": [0, 1, 3, 2],
    "生存": [1, 0, 1, 1]
}, index=["1", "2", "3", "4"])
display(df)

df.drop(["兄弟姉妹", "親子"], axis=1, inplace=True)
display(df)

       性別    年齢  兄弟姉妹  親子  生存
1  female  53.0     0   0   1
2    male  21.0     1   1   0
3  female  31.0     1   3   1
4    male   NaN     2   2   1

       性別    年齢  生存
1  female  53.0   1
2    male  21.0   0
3  female  31.0   1
4    male   NaN   1